TEXT = {
    'start': 'Сәлем, {first_name}!\n'
             'Мұнда сен өзіңнің донат-кампанияңды жасап, Telegram Жұлдыздары ⭐️ арқылы қолдау жинай аласың\n'
             'Шарттар:\n'
             '• Комиссия – 20% (азайтуға болмас еді, бірақ Telegram рұқсат бермейді)\n'
             '• Жинау мерзімі – шектеусіз\n'
             '• Төлем түскен сәтте бірден есептеледі\n'
             '• Шектеу — тек 1 донат-кампания жасауға болады\n'
             '<i>Жаңа кампания жасаған кезде ескі кампания автоматты түрде жойылады</i>\n'
             'Шығару ⭐️ 1000-нан бастап және тек бір ай өткен соң мүмкін\n'
             'Толығырақ ресми <a href="https://telegram.org/tos/affiliate-program/ru">Келісімнен</a> оқуға болады',

    'step_1': 'Бастайық! Донат-кампания жарнамасы 5 қадамнан тұрады\n\n'
              '<b>1-қадам. ФОТО жібер</b>\n'
              'Бұл сурет сенің донат-кампанияңның жарнамасында қолданылады\n'
              '<i>Бұл адамның, жануардың, заттың немесе жиналатын мақсатқа байланысты кез келген сурет болуы мүмкін</i>',

    'step_2': '<b>2-қадам. СИПАТТАМА жаз</b>\n'
              'Жиналған қаражаттың нақты қайда жұмсалатынын көрсет <i>(емдеу, паналарға көмек, қайырымдылық, жобаны қолдау және т.б.)</i>\n'
              'Мүмкіндігінше шынайы және түсінікті жазуға тырыс',

    'step_3': '<b>3-қадам. СІЛТЕМЕГЕ қысқа мәтін ойлап тап</b>\n'
              'Осы мәтінді жазылушылар постта басып, ботқа өтіп, төлем жасай алады (мысалы: <i>«Донат жасау»</i> немесе <i>«Жобаны қолдау»</i>)',

    'step_4': '<b>4-қадам. Серіктестік СІЛТЕМЕНІ жібер</b>.\n\n'
              '<i>Оны алу үшін:\n'
              '• Бот сипаттамасын аш\n'
              '• «Серіктестік бағдарлама» батырмасын бас\n'
              '• «Қатысу» батырмасын бас\n'
              '• «Сілтемені көшіру» батырмасын бас\n'
              '• Осы жерге қайта оралып, сілтемені жібер\n'
              'Сілтемені толығымен енгіз (мысалы: https:\u200B//t.me/donate_company\u200B_bot?start=donate123)</i>',

    'step_5': '<b>5-қадам. Донат сомаларын жаз</b>\n'
              'Сомаларды бос орын арқылы жаз, 2-ден 9-ға дейін нұсқа болсын\n'
              'Жазылушылар осы сомалардың бірін таңдай алады <i>(мысалы: 50 100 250 500)</i>\n'
              '<i>Бағалар Жұлдыздармен ⭐️ көрсетіледі</i>',

    'end': 'Дайын!\n'
           'Міне, сенің жариялауға арналған жарнамаң:\n'
           '<i>Оны өз тобыңда немесе Telegram-арнаңда жарияла.\n'
           'Сілтеме арқылы өткен кезде донат сомалары бар хабарландыру көрсетіледі</i>',

    "payment": {
        "label": "{purpose}",
        "title": "{purpose}",
        "description": "Бағасы: ⭐️ {amount}",
        "payment_accepted": "Төлем қабылданды. Рақмет ❤️"
    },

    "notifications": {
        "payment_sent": "Төлем жіберілді. Расталуы күтілуде",
        "payment_accepted": "Төлем қабылданды. Рақмет ❤️"
    },

    "ad": "Өз донат-кампанияңды жасау үшін\nбасың 👉 /start",
    "loading": "Тексерілуде"
}

BUTTONS_TEXT = {
    'begin': 'Донат-кампания жасау',
    'pay': 'Төлеу',
    'amount': '⭐️ {amount}'
}

IMAGE = {'step_1': '',
         'step_2': '',
         'step_3': '',
         'step_4': '',
         'step_5': '',
         'end':''
         }
