TEXT = {'start': 'Привет, {first_name}!\n'
                 'Здесь ты можешь создать свою донат-компанию и собирать донаты в Звёздах ⭐️ (Telegram Stars)\n'
                 'Условия:\n'
                 '• Комиссия - 20% (хотелось бы меньше, но Telegram не позволяет)\n'
                 '• Срок сбора - 1 месяц\n'
                 '• Начисление - в течении 1 месяца\n'
                 '• Ограничения — описаны в <a href="https://telegram.org/tos/affiliate-program/ru">Соглашении</a>',
        'step_1': 'Начнём! Объявление для донат-компании состоит из 5 шагов\n\n'
                '<b>Шаг 1. Отправь ФОТО</b>\n'
                'Оно будет использоваться в объявлении вашей донат-компании\n'
                '<i>Это может быть фото человека, питомца, предмета или любое изображение, связанное с целью сбора</i>',
        'step_2': '<b>Шаг 2. Напиши описание</b>\n'
                'Укажи, на что именно будут потрачены пожертвования <i>(лечение, помощь приюту, благотворительность, поддержка проекта и т.д.)</i>\n'
                'Постарайся написать искренне и понятно',
        'step_3': '<b>Шаг 3. Придумай короткий текст для ссылки</b>\n'
                'На этот текст в посте будут нажимать подписчики, чтобы перейти в бота для оплаты (например: <i>«Сделать донат»</i> или <i>«Поддержать проект»</i>)',
        'step_4': '<b>Шаг 4. Отправьте партнёрскую ссылку</b>. Чтобы её получить нужно:\n'
                '• Откройте описание бота\n'
                '• Нажмите \"Партнерская программа\"\n'
                '• Нажмите \"Участвовать\"\n'
                '• Нажмите \"Копировать ссылку\"\n'
                '• Вернитесь к диалогу с ботом и отправьте ссылку\n'
                '<i>Вставьте её полностью (например: https://t.me/donate_company_bot?start=donate123)</i>',
        'step_5': '<b>Шаг 5. Напишите варианты донатов</b>\n'
                'Пропишите суммы через пробел, минимум 2 варианта\n'
                'Подписчики смогут выбрать одну из них <i>(например: 50 100 250 500)</i>\n'
                '<i>Учитывайте, что цены представленны в Звездах ⭐️</i>',
        'end':''
        }

BUTTONS_TEXT = {'begin': 'Создать донат-компанию',
                'pay': 'Оплатить'}

IMAGE = {'step_1': 'AgACAgIAAxkBAAPRaN0VRp0YSu3EAAHxAblFz5YlXv1lAAK7-DEb69noSl5QzxJgHJVzAQADAgADdwADNgQ',
         'step_2': 'AgACAgIAAxkBAAPSaN0VaE0478soMSjUmqavdvI-ZfMAAr34MRvr2ehKE-rXyzkrsgsBAAMCAAN3AAM2BA',
         'step_3': 'AgACAgIAAxkBAAPTaN0Vcr6dhRIeNHS-MGF3x2RkGn4AAr_4MRvr2ehKpxrUZRkuIncBAAMCAAN3AAM2BA',
         'step_4': 'AgACAgIAAxkBAAPUaN0VeBF_Ah1PBN9ovxZka1ujVTkAAsH4MRvr2ehKghv6zMTcFDIBAAMCAAN3AAM2BA',
         'step_5': 'AgACAgIAAxkBAAPVaN0VepcGdIyMjEva_dnNelb5ft4AAsL4MRvr2ehKb8UMMpxjAjIBAAMCAAN3AAM2BA'}