TEXT = {'start': 'Привет, {first_name}!\n'
                 'Здесь ты можешь создать свою донат компанию и собирать донаты в Звёздах ⭐️ (Telegram Stars)\n'
                 'Условия:\n'
                 '• Комиссия - 20% (хотелось бы меньше, но Telegram не позволяет)\n'
                 '• Срок сбора - 1 месяц\n'
                 '• Начисление - в течении 1 месяца\n'
                 '• Ограничения — описаны в <a href="https://telegram.org/tos/affiliate-program/ru">Соглашении</a>'
        }

BUTTONS_TEXT = {'begin': 'Создать донат компанию',
                'pay': 'Оплатить'}