TEXT = {'start': 'Привет, {first_name}!\n'
                 'Здесь ты можешь создать свою донат-компанию и собирать донаты в Звёздах ⭐️ (Telegram Stars)\n'
                 'Условия:\n'
                 '• Комиссия - 20% (хотелось бы меньше, но Telegram не позволяет)\n'
                 '• Срок сбора - 1 месяц\n'
                 '• Начисление - в течении ?\n'
                 '• Ограничения — описаны в <a href="https://telegram.org/tos/affiliate-program/ru">Соглашении</a>',
        'step_1': 'Начнём! Объявление для донат-компании состоит из 5 шагов\n\n'
                '<b>Шаг 1. Отправь ФОТО</b>\n'
                'Оно будет использоваться в объявлении вашей донат-компании\n'
                '<i>Это может быть фото человека, питомца, предмета или любое изображение, связанное с целью сбора</i>',
        'step_2': '<b>Шаг 2. Напиши ОПИСАНИЕ</b>\n'
                'Укажи, на что именно будут потрачены пожертвования <i>(лечение, помощь приюту, благотворительность, поддержка проекта и т.д.)</i>\n'
                'Постарайся написать искренне и понятно',
        'step_3': '<b>Шаг 3. Придумай КОРОТКИЙ ТЕКСТ для ссылки</b>\n'
                'На этот текст в посте будут нажимать подписчики, чтобы перейти в бота для оплаты (например: <i>«Сделать донат»</i> или <i>«Поддержать проект»</i>)',
        'step_4': '<b>Шаг 4. Отправьте партнёрскую ССЫЛКУ</b>.\n\n'
                '<i>Чтобы её получить нужно:\n'
                '• Откройте описание бота\n'
                '• Нажмите \"Партнерская программа\"\n'
                '• Нажмите \"Участвовать\"\n'
                '• Нажмите \"Копировать ссылку\"\n'
                '• Вернитесь к диалогу с ботом и отправьте ссылку\n'
                'Вставьте её полностью (например: https://t.me/donate_company\u200B_bot?start=donate123)</i>',
        'step_5': '<b>Шаг 5. Напишите ВАРИАНТЫ донатов</b>\n'
                'Пропишите суммы через пробел, минимум 2 варианта\n'
                'Подписчики смогут выбрать одну из них <i>(например: 50 100 250 500)</i>\n'
                '<i>Учитывайте, что цены представленны в Звездах ⭐️</i>',
        'end':  'Готово!\n'
                'Вот ваше объявление для публикации:\n'
                '<i>При переходе по ссылке будет отображаться объявление с суммами донатов</i>',
        "payment": {"label": "{purpose}",
                    "title": "{purpose}",
                    "description": "Стоимость: ⭐️ {amount}",
                    "payment_accepted": "Ваш платёж принят. Спасибо ❤️"},

        "notifications": {"payment_sent": "Платёж отправлен. Ожидается оплата",
                          "payment_accepted": "Ваш платёж принят. Спасибо ❤️"},
        "ad": "Чтобы создать свою донат-компанию\nнажми 👉 /start",
        "loading": "Проверяем"
        }

BUTTONS_TEXT = {'begin': 'Создать донат-компанию',
                'pay': 'Оплатить',
                'amount': '⭐️ {amount}'}

IMAGE = {'step_1': 'AgACAgIAAxkBAAMOaPNv9s_YDyqZLLRlNmUzpBvC0DkAAlP4MRtVnqBLFBHrZtKvcN8BAAMCAAN3AAM2BA',
         'step_2': 'AgACAgIAAxkBAAMPaPNv_JFkXag-GpnUm-bSXa7aWNMAAlT4MRtVnqBLLrdjY1chDpcBAAMCAAN3AAM2BA',
         'step_3': 'AgACAgIAAxkBAAMQaPNwBVEVAUPa1PDMcekT8_fAiFoAAlX4MRtVnqBLdkRSBSbovrcBAAMCAAN3AAM2BA',
         'step_4': 'AgACAgIAAxkBAAMRaPNwCPwmYLhav-I3tl0N4mP8w4gAAlb4MRtVnqBLYAJSt-PZnXABAAMCAAN3AAM2BA',
         'step_5': 'AgACAgIAAxkBAAMSaPNwDLVQrj2gtmOgCzyvr8YbREoAAlf4MRtVnqBLnahmLnWHAYsBAAMCAAN3AAM2BA',
         'end':'AgACAgIAAxkBAAMTaPNwEBVTNXIpkVjkzhPwkv3JzdoAAlj4MRtVnqBL-MEHpvzfaTwBAAMCAAN3AAM2BA'
         }